RIET/src/Tasks/TripsNonLawsonApproval/TripsNonLawsonApproval.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Task>
  <name>TripsNonLawsonApproval</name>
  <basedOn>Document.TripNonLawsonCompanies</basedOn>
  <addressing>InformationRegister.TripsNonLawsonApprovalManagers</addressing>
  <attributes>
    <name>Specialist</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Trip</name>
    <type>
      <types>DocumentRef.TripNonLawsonCompanies</types>
    </type>
  </attributes>
  <attributes>
    <name>ExecutionDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>InformationForApproval</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Status</name>
    <type>
      <types>EnumRef.StatusesOfApproval</types>
    </type>
  </attributes>
  <attributes>
    <name>ReasonOfRejection</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PreviouslyApprovedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>PreviouslyApproved</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <addressingAttributes>
    <name>ApprovalManager</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </addressingAttributes>
  <addressingAttributes>
    <name>ApprovalLevel</name>
    <type>
      <types>EnumRef.ApprovalLevels</types>
    </type>
  </addressingAttributes>
</mdclass:Task>

RIET/src/Enums/StopsTypes/StopsTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>StopsTypes</name>
  <enumValues>
    <name>Source</name>
  </enumValues>
  <enumValues>
    <name>Transit</name>
  </enumValues>
  <enumValues>
    <name>Destination</name>
  </enumValues>
</mdclass:Enum>

RIET/src/Enums/ApprovalLevels/ApprovalLevels.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ApprovalLevels</name>
  <enumValues>
    <name>Level1</name>
  </enumValues>
  <enumValues>
    <name>Level2</name>
  </enumValues>
</mdclass:Enum>

RIET/src/Enums/StatusesOfApproval/StatusesOfApproval.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>StatusesOfApproval</name>
  <enumValues>
    <name>SentForApproval</name>
  </enumValues>
  <enumValues>
    <name>Approved</name>
  </enumValues>
  <enumValues>
    <name>Rejected</name>
  </enumValues>
  <enumValues>
    <name>Canceled</name>
  </enumValues>
</mdclass:Enum>

RIET/src/Tasks/TripsNonLawsonApproval/Forms/ФормаЗадачи/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Trip", Объект.Trip);

	Запрос.Текст = "ВЫБРАТЬ
	               |	TripNonLawsonCompaniesStops.Location КАК SourceLocation,
	               |	TripNonLawsonCompaniesStops.Ссылка.ZeroBaseCostsSum КАК ZeroBaseCostsSum
	               |ИЗ
	               |	Документ.TripNonLawsonCompanies.Stops КАК TripNonLawsonCompaniesStops
	               |ГДЕ
	               |	TripNonLawsonCompaniesStops.Type = ЗНАЧЕНИЕ(Перечисление.StopsTypes.Source)
	               |	И TripNonLawsonCompaniesStops.Ссылка = &Trip
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	TripNonLawsonCompaniesStops.Location
	               |ИЗ
	               |	Документ.TripNonLawsonCompanies.Stops КАК TripNonLawsonCompaniesStops
	               |ГДЕ
	               |	TripNonLawsonCompaniesStops.Type <> ЗНАЧЕНИЕ(Перечисление.StopsTypes.Source)
	               |	И TripNonLawsonCompaniesStops.Ссылка = &Trip
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	TripNonLawsonCompaniesStops.PlannedArrivalLocalTime";
	
	Результат = Запрос.ВыполнитьПакет();
	
	Выборка = Результат[0].Выбрать();
	Если Выборка.Следующий() Тогда  
		
		SourceLocation = Выборка.SourceLocation;
		
		Элементы.ZeroBaseCostSum.Видимость = Выборка.ZeroBaseCostsSum;
		Элементы.BaseCostSum.Видимость = Не Выборка.ZeroBaseCostsSum;
		Элементы.BaseCostsSumSLBUSD.Видимость = Не Выборка.ZeroBaseCostsSum;

	КонецЕсли;
	
	МассивLocation = Результат[1].Выгрузить().ВыгрузитьКолонку("Location");
	Destinations = РГСофтКлиентСервер.ПолучитьСтрокуИзМассиваПодстрокСокрЛП(МассивLocation);

	Элементы.ГруппаПредварительноеУтверждение.Видимость = (Объект.ApprovalLevel=Перечисления.ApprovalLevels.Level2);
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////////
// КОМАНДЫ

&НаКлиенте
Процедура SendForApproval(Команда)
	
	Если ЗначениеЗаполнено(Объект.Status) 
		И (Объект.Status = ПредопределенноеЗначение("Перечисление.StatusesOfApproval.SentForApproval") 
		ИЛИ Объект.Status = ПредопределенноеЗначение("Перечисление.StatusesOfApproval.Rejected")) Тогда
		Если РГСофтСерверПовтИспСеанс.ПолучитьПараметрСеансаShowNamesAndDescriptionsRUS()  Тогда 
			ТекстПредупреждения = "Текущий статус утверждения: '"+ СокрЛП(Объект.Status) +"'. 
			|Нет необходимости отправлять на утверждение.";
		Иначе 
			ТекстПредупреждения = "Current status of approval: '"+ СокрЛП(Объект.Status) +"'. 
			|No need to send for approval.";
		КонецЕсли;
		ПоказатьПредупреждение(,ТекстПредупреждения);
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаSendForApproval", ЭтаФорма);
	
	ТекстВопроса = "Send for approval and close form / Отправить на утверждение и закрыть форму?";
		
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,,, "Send for approval / Отправить на утверждение");
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаSendForApproval(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

	SendForApprovalНаСервере();	
	
	Оповестить("ЗаписанApproval", , Объект.Trip);
	ОповеститьОбИзменении(Объект.Trip);
	
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура SendForApprovalНаСервере()
	
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	
	Если Объект.Status = Перечисления.StatusesOfApproval.Rejected Тогда 
		Объект.Выполнена = Ложь;
	КонецЕсли;
	
	Объект.ПометкаУдаления = Ложь;
	Записать();
	
	ЗафиксироватьТранзакцию();	
	
КонецПроцедуры

////////////////////////////////

&НаКлиенте
Процедура CancelApproval(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Закрыть();
	КонецЕсли;
	
	Если Объект.ПометкаУдаления И ЗначениеЗаполнено(Объект.Status) 
		И Объект.Status = ПредопределенноеЗначение("Перечисление.StatusesOfApproval.Canceled") Тогда
		Если РГСофтСерверПовтИспСеанс.ПолучитьПараметрСеансаShowNamesAndDescriptionsRUS()  Тогда 
			ТекстПредупреждения = "Текущий статус утверждения: '"+ СокрЛП(Объект.Status) +"'.";
		Иначе 
			ТекстПредупреждения = "Current status of approval: '"+ СокрЛП(Объект.Status) +"'.";
		КонецЕсли;
		ПоказатьПредупреждение(,ТекстПредупреждения);
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаCancelApproval", ЭтаФорма);
	
	ТекстВопроса = "Cancel approval and close form / Отменить утверждение и закрыть форму?";
		
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,,, "Cancel approval / Отменить утверждение");
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаCancelApproval(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

	CancelApprovalНаСервере();	
	
	Оповестить("ЗаписанApproval", , Объект.Trip);
	ОповеститьОбИзменении(Объект.Trip);
	
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура CancelApprovalНаСервере()
	
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	
	Объект.ПометкаУдаления = Истина;
	Записать();
	
	ЗафиксироватьТранзакцию();	
	
КонецПроцедуры

//////////////////////////////////////////////

&НаКлиенте
Процедура Approve(Команда)
	
	Если ЗначениеЗаполнено(Объект.Status) 
		И (Объект.Status = ПредопределенноеЗначение("Перечисление.StatusesOfApproval.Canceled") 
		ИЛИ Объект.Status = ПредопределенноеЗначение("Перечисление.StatusesOfApproval.Approved")) Тогда
		Если РГСофтСерверПовтИспСеанс.ПолучитьПараметрСеансаShowNamesAndDescriptionsRUS()  Тогда 
			ТекстПредупреждения = "Текущий статус утверждения: '"+ СокрЛП(Объект.Status) +"'.";
		Иначе 
			ТекстПредупреждения = "Current status of approval: '"+ СокрЛП(Объект.Status) +"'.";
		КонецЕсли;
		ПоказатьПредупреждение(,ТекстПредупреждения);
		Возврат;
	КонецЕсли;

	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаApprove", ЭтаФорма);
	
	ТекстВопроса = "Approve trip and close form / Утвердить условия поставки и закрыть форму?";
		
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,,, "Approve / Утвердить");
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаApprove(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

	ApproveНаСервере();	
	
	Оповестить("ЗаписанApproval", , Объект.Trip);
	ОповеститьОбИзменении(Объект.Trip);
	
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ApproveНаСервере()
	
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	
	Если Объект.Status = Перечисления.StatusesOfApproval.Rejected Тогда 
		Объект.Выполнена = Ложь;
	КонецЕсли;
	
	Объект.Status = Перечисления.StatusesOfApproval.Approved;
	
	ПараметрыЗаписи = Новый Структура("ВыполнитьЗадачу", Истина);
	Записать(ПараметрыЗаписи);
	
	ЗафиксироватьТранзакцию();	
	
КонецПроцедуры

//////////////////////////////////////////////

&НаКлиенте
Процедура Reject(Команда)
	
	Если ЗначениеЗаполнено(Объект.Status) 
		И (Объект.Status = ПредопределенноеЗначение("Перечисление.StatusesOfApproval.Canceled") 
		ИЛИ Объект.Status = ПредопределенноеЗначение("Перечисление.StatusesOfApproval.Rejected")) Тогда
		Если РГСофтСерверПовтИспСеанс.ПолучитьПараметрСеансаShowNamesAndDescriptionsRUS()  Тогда 
			ТекстПредупреждения = "Текущий статус утверждения: '"+ СокрЛП(Объект.Status) +"'.";
		Иначе 
			ТекстПредупреждения = "Current status of approval: '"+ СокрЛП(Объект.Status) +"'.";
		КонецЕсли;
		ПоказатьПредупреждение(,ТекстПредупреждения);
		Возврат;
	КонецЕсли;

	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаReject", ЭтаФорма);
	
	ТекстВопроса = "Reject trip and close form/ Отклонить условия поставки и закрыть форму?";
		
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,,, "Reject / Отклонить");
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаReject(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

	RejectНаСервере();	
	
	Оповестить("ЗаписанApproval", , Объект.Trip);
	ОповеститьОбИзменении(Объект.Trip);
	
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура RejectНаСервере()
	
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	
	Если Объект.Status = Перечисления.StatusesOfApproval.Approved Тогда 
		Объект.Выполнена = Ложь;
	КонецЕсли;
	
	Объект.Status = Перечисления.StatusesOfApproval.Rejected;
	
	ПараметрыЗаписи = Новый Структура("ВыполнитьЗадачу", Истина);
	Записать(ПараметрыЗаписи);
	
	ЗафиксироватьТранзакцию();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	ОповеститьОбИзменении(Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Элементы.ГруппаПредварительноеУтверждение.Видимость = (Объект.ApprovalLevel=Перечисления.ApprovalLevels.Level2);
	
КонецПроцедуры
